# SQL Lesson 1 Examples - Getting started with SQL

## Overview

### SQL Data Types
### Relationships
- One-to-One
- One-to-Many
- Many-to-Many
### Queries
- SELECT
- LIMIT
- WHERE
- OR
- IN
- AND
- NOT
- UPPER
- LOWER
- LIKE
- ORDER BY

In [3]:
#  Setup for the SQL mentor-student examples
#pip install ipython-sql
%load_ext sql
%sql sqlite:///../Data/mentor-student/mentor-student.db

# SQL Data Types


<p style="text-align: center;">
  <img width="600" alt="Software comparison chart" src="./Media/SQLDataTypes.png">
</p>

# Relationship Examples


<p style="text-align: center;">
  <img width="600" alt="Software comparison chart" src="./Media/relationships.png">
</p>

If you say the word “many” only once, then this is one-to-many relation. If you would use the word “many” two times, the relation would be many-to-many. And if you wouldn’t use it at all, then it would be one-to-one.

## Examples - Mentor and student relationships:

### One-to-One
- When one row in a table is linked to only one row in another table.
> In a student database, each student has only one student ID, and that ID is only assigned to one person. We have not used the word “many”, so this can’t be any type of relation including the word “many”.

In [4]:
%%sql

SELECT studentName, fullId FROM students
JOIN studentIdentification USING(studentId);

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[('Jon', '85643215SWD'),
 ('Jane', '89654398DSO'),
 ('Andrew', '21405478SWD'),
 ('Stephen', '65321098SWD'),
 ('Sarah', '30124578DSO'),
 ('Kim', '10254901CSO')]

### One-to-Many
- When one row in a table is linked to many rows in another table.
> One city can have `many` different students located in it. And the other way around – One student can have only one city. If you said the word “many” only once, then this is one-to-many relation.

In [5]:
%%sql

SELECT cityName, studentName FROM city
JOIN students USING(cityId)
ORDER BY cityName;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[('Las Vegas', 'Jane'),
 ('Las Vegas', 'Kim'),
 ('Miami', 'Andrew'),
 ('Phoenix', 'Jon'),
 ('Phoenix', 'Stephen'),
 ('Phoenix', 'Sarah')]

### Many-to-Many
- When any rows in a table are linked to many rows in another table.
> One mentor, could call `many` students. Also, one student, could receive calls from `many` mentors. Notice that we’ve mentioned the word “many” two times. This is the signal we need to resolve this using many-to-many relation.

In [6]:
%%sql

SELECT mentorName, studentName, dateTime FROM callLog
JOIN mentors USING(mentorId)
JOIN students USING(studentId);

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[('Callan', 'Jon', '2021-10-06 13:04:05'),
 ('Callan', 'Jane', '2021-10-01 11:26:27'),
 ('Callan', 'Andrew', '2021-10-02 09:14:06'),
 ('Britt', 'Stephen', '2021-10-03 15:52:59'),
 ('Britt', 'Jane', '2021-10-04 13:19:11'),
 ('Joe', 'Jane', '2021-10-05 02:33:45')]

# Query Examples
- SELECT
- LIMIT
- WHERE
- OR
- IN
- AND
- NOT
- UPPER
- LOWER
- LIKE
- ORDER BY

### SELECT
> SELECT all students

In [7]:
%%sql

SELECT * FROM students;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(1, 'Jon', 1),
 (2, 'Jane', 2),
 (3, 'Andrew', 3),
 (4, 'Stephen', 1),
 (5, 'Sarah', 1),
 (6, 'Kim', 2)]

### LIMIT
> SELECT students with a LIMIT of 2 results

In [8]:
%%sql

SELECT * FROM students
LIMIT 2;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(1, 'Jon', 1), (2, 'Jane', 2)]

### WHERE
> SELECT students WHERE studentId is greater than 4

In [9]:
%%sql

SELECT * FROM students
WHERE studentId > 4;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(5, 'Sarah', 1), (6, 'Kim', 2)]

### OR
> SELECT students WHERE studentId is 2 OR 3

In [10]:
%%sql

SELECT * FROM students
WHERE studentId = 2 OR studentId = 3;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(2, 'Jane', 2), (3, 'Andrew', 3)]

### IN
> SELECT students WHERE studentId is 2 OR 3 OR 6 (In is shorthand for having multiple OR conditions)

In [11]:
%%sql

SELECT * FROM students
WHERE studentId IN (2, 3, 6);

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(2, 'Jane', 2), (3, 'Andrew', 3), (6, 'Kim', 2)]

### AND
> SELECT students WHERE studentId is 2 AND studentName is Jane

In [12]:
%%sql

SELECT * FROM students
WHERE studentId = 2 AND studentName = "Jane";

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(2, 'Jane', 2)]

### NOT
> SELECT students WHERE studentName is NOT Jane

In [13]:
%%sql

SELECT * FROM students
WHERE studentName != "Jane";

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(1, 'Jon', 1),
 (3, 'Andrew', 3),
 (4, 'Stephen', 1),
 (5, 'Sarah', 1),
 (6, 'Kim', 2)]

### UPPER
> Change all mentor names to uppercase

In [14]:
%%sql

SELECT UPPER(mentorName) FROM mentors;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[('CALLAN',), ('BRITT',), ('JOE',), ('CASS',), ('DANIEL',), ('SHAUN',)]

### LOWER
> Change all mentor names to lowercase

In [15]:
%%sql

SELECT LOWER(mentorName) FROM mentors;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[('callan',), ('britt',), ('joe',), ('cass',), ('daniel',), ('shaun',)]

### LIKE
> SELECT students WHERE studentName is starts with J

In [16]:
%%sql

SELECT * FROM students
WHERE studentName LIKE "J%";

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(1, 'Jon', 1), (2, 'Jane', 2)]

### ORDER BY
> Select all mentors and ORDER BY mentorName

In [17]:
%%sql

SELECT * FROM mentors
ORDER BY mentorName;

 * sqlite:///../Data/mentor-student/mentor-student.db
Done.

[(2, 'Britt'),
 (1, 'Callan'),
 (4, 'Cass'),
 (5, 'Daniel'),
 (3, 'Joe'),
 (6, 'Shaun')]